<?php

return [
    //--------------------------------------------------------------------------
    // Alerts prefixes (Layout)
    //--------------------------------------------------------------------------
    'Well done!'                                => 'Готово!',
    'Warning!'                                  => 'Предупреждение!',
    'Info:'                                     => 'Инфо:',
    'Error!'                                    => 'Ошибка!',
    //--------------------------------------------------------------------------
    // Alerts messages
    //--------------------------------------------------------------------------
    'Failed to login'                           => 'Не удалось войти',
    'Can\'t get Discord token'                  => 'Не удалось получить Discord-токен',
    'Internal server error'                     => 'Внутренняя ошибка сервера',
    //--------------------------------------------------------------------------
    // Header & Jumbotron
    //--------------------------------------------------------------------------
    'About Server'                              => 'О сервере',
    'Play'                                      => 'Играть',
    //---- header/footer: ----
    'Rules'                                     => 'Правила',
    'Spawns'                                    => 'Спауны',
    'Players'                                   => 'Игроки',
    'Clans'                                     => 'Кланы',
    'Map'                                       => 'Карта',
    'Videos'                                    => 'Видео',
    'Login'                                     => 'Войти',
    //---- footer: ----
    'Community'                                 => 'Сообщество',
    'Development'                               => 'Development',
    'VK'                                        => 'ВКонтакте',
    'Lord Server Team'                          => 'Команда сервера LORD',
    'Sources'                                   => 'Исходники',
    //---- jumbotron: ----
    'jumbo'                                     => [
        'phrase' => [
            'home'   => '
                Российский сервер Minetest по мотивам легендариума Дж. Толкина ("Властелин Колец", "Хоббит", ...), где игроки —
                кто поодиночке, кто в дружине, кто в клане — пишут историю нашего сервера:
                трудятся, отдыхают, торгуют, сражаются...<br>
                Словом, поодиночке или с друзьями проявляют свою доблесть!',
            'spawns' => '
                Сегодня мой сто одиннадцатый день рождения. Увы, сто одиннадцать лет — это слишком мало,
                когда живёшь среди таких чудесных и славных хоббитов.',
            'clans'  => '
                — Это гундабадские варги. Они догонят тебя!<br>
                — А это росгобельские кролики. Посмотрим, кто кого!',
            'map'    => '
                Опасное это дело, Фродо, — выходить за порог.
                Стоит ступить на дорогу и, если дашь волю ногам, неизвестно куда тебя занесёт.',
            'about'  => 'Даже самый маленький человек способен изменить ход будущего.',
        ],
    ],

    //--------------------------------------------------------------------------
    // On Pages messages
    //--------------------------------------------------------------------------
    // Home:
    'News'                                      => 'Новости',
    'Gallery'                                   => 'Галерея',
    'In Game'                                   => 'В игре',
    'PvP-Tournament'                            => 'PvP-Турнир',
    // ----
    'Others'                                    => 'Другие',
    // Spawns:
    'Where players are born'                    => 'Где рождаются игроки',
    'actively-builds'                           => 'активно строится, скоро запуск',
    'planned'                                   => 'запланирован',
    'spawns'                                    => [
        'Orcish'  => 'Орочий',
        'Human'   => 'Людской',
        'Hobbit'  => 'Хоббичий',
        'Elven'   => 'Эльфийский',
        'Dwarven' => 'Гномий',
        'Central' => 'Центральный',
    ],
    'roles'                                     => [
        'Keepers'       => 'Смотрители',
        'Squad'         => 'Дружина',
        'vacancy'       => 'вакансия',
        'vacancy-later' => 'вакансия-позже',
    ],
    // Play
    'How to play'                               => 'Как поиграть',
    'Download Minetest'                         => 'Скачайте Minetest',
    'Launch & find LORD'                        => 'Запустите MT и найдите сервер L.O.R.D.',
    'Open the %s tab'                           => 'Откройте вкладку %s',
    'Join Game'                                 => 'Подключиться к игре',
    'Type %s or %s in the search and click'     => 'Наберите в поиске %s или %s и нажмите',
    // Clans
    'Server clans'                              => 'Кланы сервера',
    // Map
    'Map of our world'                          => 'Карта нашего мира',
    'map-page'                                  => [
        'new' => [
            'New Version'  => 'Новый вариант',
            'description1' => 'На данный момент находится в активной разработке.',
            'description2' => '
                    Карта пока только небольшой части мира.
                    Однако она с новыми постройками и 3D!',
        ],
        'old' => [
            'Old Version' => 'Старый вариант',
            'description' => '
                    Эта карта очень давно не обновлялась и на ней запечатлён мир 5ти - 7ми летней давности.
                    Однако её размер полон и можно посмотреть, где какие биомы/реки/моря.',
        ],
    ],
    // Rules
    'Server Rules'                              => 'Правила Сервера',
    'Common Rules'                              => 'Общие Правила',
    'Clans Rules'                               => 'Правила Кланов',

    // 404
    'Page not found'                            => 'Страница не найдена',
    'Sorry, page not found!'                    => 'Пардон, страница, которую вы ищите, не найдена!',
    'Please let us know about the missing page' => 'Пожалуйста, сообщите нам о пропавшей странице',
    'report an error on the website'            => 'сообщить об ошибке на сайте',
];
