<?php

return [
    //--------------------------------------------------------------------------
    // Alerts prefixes (Layout)
    //--------------------------------------------------------------------------
    'Well done!'               => 'Готово!',
    'Warning!'                 => 'Предупреждение!',
    'Info:'                    => 'Инфо:',
    'Error!'                   => 'Ошибка!',
    //--------------------------------------------------------------------------
    // Alerts messages
    //--------------------------------------------------------------------------
    'Failed to login'          => 'Не удалось войти',
    'Can\'t get Discord token' => 'Не удалось получить Discord-токен',
    'Internal server error'    => 'Внутренняя ошибка сервера',
    //--------------------------------------------------------------------------
    // Header & Jumbotron
    //--------------------------------------------------------------------------
    'About Server'             => 'О сервере',
    'Play'                     => 'Играть',
    //---- header/footer: ----
    'Rules'                    => 'Правила',
    'Spawns'                   => 'Спауны',
    'Clans'                    => 'Кланы',
    'Map'                      => 'Карта',
    'Videos'                   => 'Видео',
    'Login'                    => 'Войти',
    //---- footer: ----
    'Community'                => 'Сообщество',
    'Development'              => 'Development',
    'VK'                       => 'ВКонтакте',
    'Lord Server Team'         => 'Команда сервера LORD',
    'Sources'                  => 'Исходники',
    //---- jumbotron: ----
    'jumbo.phrase.home'        => '
                Российский сервер Minetest по мотивам легендариума Дж. Толкина ("Властелин Колец", "Хоббит", ...), где игроки —
                кто поодиночке, кто в дружине, кто в клане — пишут историю нашего сервера:
                трудятся, отдыхают, торгуют, сражаются...<br>
                Словом, поодиночке или с друзьями проявляют свою доблесть!
',

    //--------------------------------------------------------------------------
    // On Pages messages
    //--------------------------------------------------------------------------
    // Home:
    'News'                     => 'Новости',
    'Gallery'                  => 'Галерея',
    'In Game'                  => 'В игре',
    'PvP-Tournament'           => 'PvP-Турнир',
    // ----
    'Others'                   => 'Другие',
    // Spawns:
    'spawns'                   => [
        'Orcish'  => 'Орочий',
        'Human'   => 'Людской',
        'Hobbit'  => 'Хоббичий',
        'Elven'   => 'Эльфийский',
        'Dwarven' => 'Гномий',
        'Central' => 'Центральный',
    ],
    'spawn'                    => [
        'Keepers' => 'Смотрители',
        'Squad'   => 'Дружина',
    ],
];
