<?php

return [
    //--------------------------------------------------------------------------
    // Alerts prefixes (Layout)
    //--------------------------------------------------------------------------
    'Well done!'               => 'Готово!',
    'Warning!'                 => 'Предупреждение!',
    'Info:'                    => 'Инфо:',
    'Error!'                   => 'Ошибка!',
    //--------------------------------------------------------------------------
    // Alerts messages
    //--------------------------------------------------------------------------
    'Failed to login'          => 'Не удалось войти',
    'Can\'t get Discord token' => 'Не удалось получить Discord-токен',
    'Internal server error'    => 'Внутренняя ошибка сервера',
    //--------------------------------------------------------------------------
    // Header & Jumbotron
    //--------------------------------------------------------------------------
    'About Server'             => 'О сервере',
    'Play'                     => 'Играть',


    //--------------------------------------------------------------------------
    // On Pages messages
    //--------------------------------------------------------------------------
    'Others'                   => 'Другие',
    // Spawns:
    'spawns'                   => [
        'Orcish'  => 'Орочий',
        'Human'   => 'Людской',
        'Hobbit'  => 'Хоббичий',
        'Elven'   => 'Эльфийский',
        'Dwarven' => 'Гномий',
        'Central' => 'Центральный',
    ],
    'spawn'                    => [
        'Keepers' => 'Смотрители',
        'Squad'   => 'Дружина',
    ],
];
